<template>
    <div class="wrap">
        <toph  v-bind:active="active" class="nav"></toph>
        <div class="main">
            <div class="title">历史溯源</div>
            <div class="search-box">
                <el-form :inline="true" :model="formData" class="form-box">
                    <el-form-item label="车型">
                        <el-select v-model="formData.carType" placeholder="请选择" size="small">
                            <el-option label="北汽新能源EX360" value="0"></el-option>
                        </el-select>
                    </el-form-item>
                    <el-form-item label="车辆VIN">
                        <el-input v-model="formData.carVIN" placeholder="请输入" size="small"></el-input>
                    </el-form-item>
                    <el-form-item>
                        <el-button type="primary" @click="handleSearch" size="small">搜索</el-button>
                        <el-button @click="handleReset" size="small">重置</el-button>
                    </el-form-item>
                </el-form>
            </div>
            <div class="table-box">
                <el-tabs class="tabs-box" v-model="activeName">
                    <el-tab-pane label="充电记录">
                        <HistoricalTable :tableData="tableData1" v-if="activeName == 0"></HistoricalTable>
                        <div class="pagingtion-box" style="display: flex; justify-content: flex-end;padding: 20px 0 0;">
                            <el-pagination
                                @size-change="handleSizeChange1"
                                @current-change="handleCurrentChange1"
                                :current-page="currentPage1"
                                :page-sizes="[10, 20, 30, 40]"
                                :page-size="pageSize1"
                                layout="total, sizes, prev, pager, next, jumper"
                                :total="total1">
                            </el-pagination>
                            <el-button size="small" type="primary" style="margin-left: 20px;" @click="handleCurrentChange1">确定</el-button>
                        </div>
                    </el-tab-pane>
                    <el-tab-pane label="报警记录">
                        <HistoricalTable :tableData="tableData2" v-if="activeName == 1"></HistoricalTable>
                        <div class="pagingtion-box" style="display: flex; justify-content: flex-end;padding: 20px 0 0;">
                            <el-pagination
                                @size-change="handleSizeChange2"
                                @current-change="handleCurrentChange2"
                                :current-page="currentPage2"
                                :page-sizes="[10, 20, 30, 40]"
                                :page-size="pageSize2"
                                layout="total, sizes, prev, pager, next, jumper"
                                :total="total2">
                            </el-pagination>
                            <el-button size="small" type="primary" style="margin-left: 20px;" @click="handleCurrentChange2">确定</el-button>
                        </div>
                    </el-tab-pane>
                    <el-tab-pane label="预警记录">
                        <HistoricalTable :tableData="tableData3"  v-if="activeName == 2"></HistoricalTable>
                        <div class="pagingtion-box" style="display: flex; justify-content: flex-end;padding: 20px 0 0;">
                            <el-pagination
                                @size-change="handleSizeChange3"
                                @current-change="handleCurrentChange3"
                                :current-page="currentPage3"
                                :page-sizes="[10, 20, 30, 40]"
                                :page-size="pageSize3"
                                layout="total, sizes, prev, pager, next, jumper"
                                :total="total3">
                            </el-pagination>
                            <el-button size="small" type="primary" style="margin-left: 20px;" @click="handleCurrentChange3">确定</el-button>
                        </div>
                    </el-tab-pane>
                    <el-tab-pane label="维修记录">
                        <HistoricalTable :tableData="tableData4" v-if="activeName == 3"></HistoricalTable>
                        <div class="pagingtion-box" style="display: flex; justify-content: flex-end;padding: 20px 0 0;">
                            <el-pagination
                                @size-change="handleSizeChange4"
                                @current-change="handleCurrentChange4"
                                :current-page="currentPage4"
                                :page-sizes="[10, 20, 30, 40]"
                                :page-size="pageSize4"
                                layout="total, sizes, prev, pager, next, jumper"
                                :total="total4">
                            </el-pagination>
                            <el-button size="small" type="primary" style="margin-left: 20px;" @click="handleCurrentChange4">确定</el-button>
                        </div>
                    </el-tab-pane>
                    <el-tab-pane label="行程记录">
                        <HistoricalTable :tableData="tableData5" v-if="activeName == 4"></HistoricalTable>
                        <div class="pagingtion-box" style="display: flex; justify-content: flex-end;padding: 20px 0 0;">
                            <el-pagination
                                @size-change="handleSizeChange5"
                                @current-change="handleCurrentChange5"
                                :current-page="currentPage5"
                                :page-sizes="[10, 20, 30, 40]"
                                :page-size="pageSize5"
                                layout="total, sizes, prev, pager, next, jumper"
                                :total="total5">
                            </el-pagination>
                            <el-button size="small" type="primary" style="margin-left: 20px;" @click="handleCurrentChange5">确定</el-button>
                        </div>
                    </el-tab-pane>
                </el-tabs>
            </div>
        </div>
    </div>
</template>
<script>
import toph from "@/components/top";
import HistoricalTable from '@/components/HistoricalTable'
export default {
    data () {
        return {
            active: 5,
            activeName: '0',
            formData: {
                carType: '',
                carNumber: '',
                carVIN: ''
            },
            total1: 13,
            currentPage1: 1,
            pageSize1: 5,
            total2: 13,
            currentPage2: 1,
            pageSize2: 5,
            total3: 13,
            currentPage3: 1,
            pageSize3: 5,
            total4: 6,
            currentPage4: 1,
            pageSize4: 5,
            total5: 13,
            currentPage5: 1,
            pageSize5: 5,
            tableData1: {
                thead: ['电池所在设备', '充电开始时间', '充电开始SOC/%', '充电结束时间', '充电结束SOC/%', '充电电量Ah', '操作'],
                tbody: [   
                ['2019/6/20 12:06:00', 40, '2019/6/20 14:06:00', 98, 93],
                ['2019/6/19 12:56:00', 45, '2019/6/19 14:00:00', 79, 93],
                ['2019/6/18 12:46:00', 43, '2019/6/18 14:35:00', 100, 94],
                ['2019/6/17 12:36:00', 25, '2019/6/17 15:36:00', 96, 95],
                ['2019/6/15 12:26:00', 42, '2019/6/15 15:03:00', 75, 93],
                ['2019/6/14 12:16:00', 40, '2019/6/14 15:10:00', 95, 94],
                ['2019/6/13 12:06:00', 45, '2019/6/13 13:58:00', 98, 91],
                ['2019/6/12 11:56:00', 25, '2019/6/12 15:28:00', 98, 90],
                ['2019/6/10 11:46:00', 35, '2019/6/10 13:53:00', 100, 85],
                ['2019/6/8 11:36:00', 25, '2019/6/8 15:07:00', 85, 99],
                ],
                firstTdData: ['北汽新能源EX360', '车牌号京A88888', 'VIN: WBAZV4109BL817920'],
                type: 0
            },
            tableData2: {
                thead: ['电池所在设备', '报警类型', '报警时间', '持续时长', '操作'],
                tbody: [
                   ['高温电池报警', '2019/6/18 11:59:00', '0:02:34'],
                    ['高温电池报警', '2019/6/17 11:44:00', '0:12:42'],
                    ['高温电池报警', '2019/6/15 12:22:00', '0:02:44'],
                    ['高温电池报警', '2019/6/14 11:26:00', '0:02:42'],
                    ['高温电池报警', '2019/6/13 12:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/12 11:06:00', '0:11:42'],
                    ['高温电池报警', '2019/6/11 10:06:00', '0:02:33'],
                    ['高温电池报警', '2019/6/10 11:19:00', '0:02:42'],
                    ['高温电池报警', '2019/6/9 11:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/8 10:06:00', '0:34:55']
                ],
                firstTdData: ['北汽新能源EX360', '车牌号京A88888', 'VIN: WBAZV4109BL817920'],
                type: 1
            },
            tableData3: {
                thead: ['电池所在设备', '预警风险等级', '预警名称', '预警状态', '操作'],
                tbody: [
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [3, '电压异常预警', '已审核'],
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [3, '电压异常预警', '已审核'],
                    [2, '电压异常预警', '已审核'],
                    [1, '车辆离群预警', '已审核'],
                    [4, '车辆离群预警', '已审核'],
                    [2, '车辆离群预警', '已审核']
                ],
                firstTdData: ['北汽新能源EX360', '车牌号京A88888', 'VIN: WBAZV4109BL817920'],
                type: 2
            },
            tableData4: {
                thead: ['电池所在设备', '维修原因', '维修时间', '维修方式'],
                tbody: [
                   ['电池高温异常维修', '2019/6/18 16:16:00', '人工维修'],
                    ['绝缘维修', '2019/6/5 11:06:00', '机器维修'],
                    ['电池高温异常维修', '2019/5/18 11:26:00', '人工维修'],
                    ['电池高温异常维修', '2019/4/15 9:36:00', '人工维修'],
                    ['绝缘维修', '2019/3/10 19:46:00', '机器维修'],
                    ['电池高温异常维修', '2019/2/2 18:56:00', '人工维修'],
                ],
                firstTdData: ['北汽新能源EX360', '车牌号京A88888', 'VIN: WBAZV4109BL817920'],
                type: 3
            },
            tableData5: {
                thead: ['电池所在设备', '里程', '时间', '时长', '次数', '操作'],
                tbody: [
                    ['43', '2019/6/20 14:06:00', '2:06:34', '39'],
                    ['45', '2019/6/19 12:56:00', '3:06:00', '38'],
                    ['47', '2019/6/18 12:46:00', '4:06:25', '37'],
                    ['49', '2019/6/17 12:36:00', '2:06:00', '36'],
                    ['51', '2019/6/15 12:26:00', '3:06:00', '35'],
                    ['53', '2019/6/14 12:16:00', '4:04:44', '34'],
                    ['55', '2019/6/13 12:06:00', '2:06:00', '33'],
                    ['57', '2019/6/12 11:56:00', '3:06:00', '32'],
                    ['59', '2019/6/10 11:46:00', '4:02:35', '31'],
                    ['61', '2019/6/8 15:36:00', '4:06:00', '30']
                ],
                firstTdData: ['北汽新能源EX360', '车牌号京A88888', 'VIN: WBAZV4109BL817920'],
                type: 4
            }
        }
    },
    methods: {
        handleSearch () {
            if (this.formData.carType == 0 && (this.formData.carVIN == '' || this.formData.carVIN == 'WBAZV4109BL817920' )) {
                this.tableData1.tbody = [
                ['2019/6/20 12:06:00', 40, '2019/6/20 14:06:00', 98, 93],
                ['2019/6/19 12:56:00', 45, '2019/6/19 14:00:00', 79, 93],
                ['2019/6/18 12:46:00', 43, '2019/6/18 14:35:00', 100, 94],
                ['2019/6/17 12:36:00', 25, '2019/6/17 15:36:00', 96, 95],
                ['2019/6/15 12:26:00', 42, '2019/6/15 15:03:00', 75, 93],
                ['2019/6/14 12:16:00', 40, '2019/6/14 15:10:00', 95, 94],
                ['2019/6/13 12:06:00', 45, '2019/6/13 13:58:00', 98, 91],
                ['2019/6/12 11:56:00', 25, '2019/6/12 15:28:00', 98, 90],
                ['2019/6/10 11:46:00', 35, '2019/6/10 13:53:00', 100, 85],
                ['2019/6/8 11:36:00', 25, '2019/6/8 15:07:00', 85, 99],
                ]
                
                this.tableData2.tbody = [
                     ['高温电池报警', '2019/6/18 11:59:00', '0:02:34'],
                    ['高温电池报警', '2019/6/17 11:44:00', '0:12:42'],
                    ['高温电池报警', '2019/6/15 12:22:00', '0:02:44'],
                    ['高温电池报警', '2019/6/14 11:26:00', '0:02:42'],
                    ['高温电池报警', '2019/6/13 12:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/12 11:06:00', '0:11:42'],
                    ['高温电池报警', '2019/6/11 10:06:00', '0:02:33'],
                    ['高温电池报警', '2019/6/10 11:19:00', '0:02:42'],
                    ['高温电池报警', '2019/6/9 11:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/8 10:06:00', '0:34:55']
                ]

                this.tableData3.tbody = [
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [3, '电压异常预警', '已审核'],
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [3, '电压异常预警', '已审核'],
                    [2, '电压异常预警', '已审核'],
                    [1, '车辆离群预警', '已审核'],
                    [4, '车辆离群预警', '已审核'],
                    [2, '车辆离群预警', '已审核']
                ]

                this.tableData4.tbody = [
                   ['电池高温异常维修', '2019/6/18 16:16:00', '人工维修'],
                    ['绝缘维修', '2019/6/5 11:06:00', '机器维修'],
                    ['电池高温异常维修', '2019/5/18 11:26:00', '人工维修'],
                    ['电池高温异常维修', '2019/4/15 9:36:00', '人工维修'],
                    ['绝缘维修', '2019/3/10 19:46:00', '机器维修'],
                    ['电池高温异常维修', '2019/2/2 18:56:00', '人工维修'],
                ]

                this.tableData5.tbody = [
                     ['43', '2019/6/20 14:06:00', '2:06:34', '39'],
                    ['45', '2019/6/19 12:56:00', '3:06:00', '38'],
                    ['47', '2019/6/18 12:46:00', '4:06:25', '37'],
                    ['49', '2019/6/17 12:36:00', '2:06:00', '36'],
                    ['51', '2019/6/15 12:26:00', '3:06:00', '35'],
                    ['53', '2019/6/14 12:16:00', '4:04:44', '34'],
                    ['55', '2019/6/13 12:06:00', '2:06:00', '33'],
                    ['57', '2019/6/12 11:56:00', '3:06:00', '32'],
                    ['59', '2019/6/10 11:46:00', '4:02:35', '31'],
                    ['61', '2019/6/8 15:36:00', '4:06:00', '30']
                ]
            } else {
                this.tableData1.tbody = []
                this.tableData2.tbody = []
                this.tableData3.tbody = []
                this.tableData4.tbody = []
                this.tableData5.tbody = []
                this.total1 = 0
                this.total2 = 0
                this.total3 = 0
                this.total4 = 0
                this.total5 = 0
            }
        },
        handleReset () {
            this.formData = {
                carType: '',
                carNumber: '',
                carVIN: ''
            }
            this.total1 = 13
            this.total2 = 13
            this.total3 = 13
            this.total4 = 13
            this.total5 = 13
            this.tableData1.tbody = [
               ['2019/6/20 12:06:00', 40, '2019/6/20 14:06:00', 98, 93],
                ['2019/6/19 12:56:00', 45, '2019/6/19 14:00:00', 79, 93],
                ['2019/6/18 12:46:00', 43, '2019/6/18 14:35:00', 100, 94],
                ['2019/6/17 12:36:00', 25, '2019/6/17 15:36:00', 96, 95],
                ['2019/6/15 12:26:00', 42, '2019/6/15 15:03:00', 75, 93],
                ['2019/6/14 12:16:00', 40, '2019/6/14 15:10:00', 95, 94],
                ['2019/6/13 12:06:00', 45, '2019/6/13 13:58:00', 98, 91],
                ['2019/6/12 11:56:00', 25, '2019/6/12 15:28:00', 98, 90],
                ['2019/6/10 11:46:00', 35, '2019/6/10 13:53:00', 100, 85],
                ['2019/6/8 11:36:00', 25, '2019/6/8 15:07:00', 85, 99],
                ['2019/6/7 11:26:00', 38, '2019/6/7 14:32:00', 80, 98],
                ['2019/6/6 11:16:00', 45, '2019/6/6 13:25:00', 100, 96],
                ['2019/6/5 11:06:00', 35, '2019/6/5 15:00:00', 89, 92],
            ]
            
            this.tableData2.tbody = [
                 ['高温电池报警', '2019/6/18 11:59:00', '0:02:34'],
                    ['高温电池报警', '2019/6/17 11:44:00', '0:12:42'],
                    ['高温电池报警', '2019/6/15 12:22:00', '0:02:44'],
                    ['高温电池报警', '2019/6/14 11:26:00', '0:02:42'],
                    ['高温电池报警', '2019/6/13 12:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/12 11:06:00', '0:11:42'],
                    ['高温电池报警', '2019/6/11 10:06:00', '0:02:33'],
                    ['高温电池报警', '2019/6/10 11:19:00', '0:02:42'],
                    ['高温电池报警', '2019/6/9 11:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/8 10:06:00', '0:34:55']
            ]

            this.tableData3.tbody = [
                [4, '电压异常预警', '已审核'],
                [1, '电压异常预警', '已审核'],
                [3, '电压异常预警', '已审核'],
                [4, '电压异常预警', '已审核'],
                [1, '电压异常预警', '已审核'],
                [3, '电压异常预警', '已审核'],
                [2, '电压异常预警', '已审核'],
                [1, '车辆离群预警', '已审核'],
                [4, '车辆离群预警', '已审核'],
                [2, '车辆离群预警', '已审核']
            ]

            this.tableData4.tbody = [
               ['电池高温异常维修', '2019/6/18 16:16:00', '人工维修'],
                    ['绝缘维修', '2019/6/5 11:06:00', '机器维修'],
                    ['电池高温异常维修', '2019/5/18 11:26:00', '人工维修'],
                    ['电池高温异常维修', '2019/4/15 9:36:00', '人工维修'],
                    ['绝缘维修', '2019/3/10 19:46:00', '机器维修'],
                    ['电池高温异常维修', '2019/2/2 18:56:00', '人工维修'],
            ]

            this.tableData5.tbody = [
                 ['43', '2019/6/20 14:06:00', '2:06:34', '39'],
                    ['45', '2019/6/19 12:56:00', '3:06:00', '38'],
                    ['47', '2019/6/18 12:46:00', '4:06:25', '37'],
                    ['49', '2019/6/17 12:36:00', '2:06:00', '36'],
                    ['51', '2019/6/15 12:26:00', '3:06:00', '35'],
                    ['53', '2019/6/14 12:16:00', '4:04:44', '34'],
                    ['55', '2019/6/13 12:06:00', '2:06:00', '33'],
                    ['57', '2019/6/12 11:56:00', '3:06:00', '32'],
                    ['59', '2019/6/10 11:46:00', '4:02:35', '31'],
                    ['61', '2019/6/8 15:36:00', '4:06:00', '30']
            ]
        },
        handleCurrentChange1  (val) {
            if (val == 1) {
                this.tableData1.tbody = [
                    ['2019/6/20 12:06:00', 40, '2019/6/20 14:06:00', 98, 93],
                ['2019/6/19 12:56:00', 45, '2019/6/19 14:00:00', 79, 93],
                ['2019/6/18 12:46:00', 43, '2019/6/18 14:35:00', 100, 94],
                ['2019/6/17 12:36:00', 25, '2019/6/17 15:36:00', 96, 95],
                ['2019/6/15 12:26:00', 42, '2019/6/15 15:03:00', 75, 93],
                ['2019/6/14 12:16:00', 40, '2019/6/14 15:10:00', 95, 94],
                ['2019/6/13 12:06:00', 45, '2019/6/13 13:58:00', 98, 91],
                ['2019/6/12 11:56:00', 25, '2019/6/12 15:28:00', 98, 90],
                ['2019/6/10 11:46:00', 35, '2019/6/10 13:53:00', 100, 85],
                
                    
                ]
            } else if (val == 2) {
                this.tableData1.tbody = [
                   ['2019/6/8 11:36:00', 25, '2019/6/8 15:07:00', 85, 99],
                ['2019/6/7 11:26:00', 38, '2019/6/7 14:32:00', 80, 98],
                ['2019/6/6 11:16:00', 45, '2019/6/6 13:25:00', 100, 96],
                ['2019/6/5 11:06:00', 35, '2019/6/5 15:00:00', 89, 92],
                    
                   
                   
                ]
            }
        },
        handleSizeChange1 (val) {
            if (val == 10) {
                this.tableData1.tbody = [
                    ['2019/6/20 12:06:00', 40, '2019/6/20 14:06:00', 98, 93],
                ['2019/6/19 12:56:00', 45, '2019/6/19 14:00:00', 79, 93],
                ['2019/6/18 12:46:00', 43, '2019/6/18 14:35:00', 100, 94],
                ['2019/6/17 12:36:00', 25, '2019/6/17 15:36:00', 96, 95],
                ['2019/6/15 12:26:00', 42, '2019/6/15 15:03:00', 75, 93],
                ['2019/6/14 12:16:00', 40, '2019/6/14 15:10:00', 95, 94],
                ['2019/6/13 12:06:00', 45, '2019/6/13 13:58:00', 98, 91],
                ['2019/6/12 11:56:00', 25, '2019/6/12 15:28:00', 98, 90],
                ['2019/6/10 11:46:00', 35, '2019/6/10 13:53:00', 100, 85],
                ]
            } else {
                this.tableData1.tbody = [
                ['2019/6/20 12:06:00', 40, '2019/6/20 14:06:00', 98, 93],
                ['2019/6/19 12:56:00', 45, '2019/6/19 14:00:00', 79, 93],
                ['2019/6/18 12:46:00', 43, '2019/6/18 14:35:00', 100, 94],
                ['2019/6/17 12:36:00', 25, '2019/6/17 15:36:00', 96, 95],
                ['2019/6/15 12:26:00', 42, '2019/6/15 15:03:00', 75, 93],
                ['2019/6/14 12:16:00', 40, '2019/6/14 15:10:00', 95, 94],
                ['2019/6/13 12:06:00', 45, '2019/6/13 13:58:00', 98, 91],
                ['2019/6/12 11:56:00', 25, '2019/6/12 15:28:00', 98, 90],
                ['2019/6/10 11:46:00', 35, '2019/6/10 13:53:00', 100, 85],
                ['2019/6/8 11:36:00', 25, '2019/6/8 15:07:00', 85, 99],
                ['2019/6/7 11:26:00', 38, '2019/6/7 14:32:00', 80, 98],
                ['2019/6/6 11:16:00', 45, '2019/6/6 13:25:00', 100, 96],
                ['2019/6/5 11:06:00', 35, '2019/6/5 15:00:00', 89, 92],   
                ]
            }
        },
        handleCurrentChange2  (val) {
            if (val == 1) {
                this.tableData2.tbody = [
                     ['高温电池报警', '2019/6/18 11:59:00', '0:02:34'],
                    ['高温电池报警', '2019/6/17 11:44:00', '0:12:42'],
                    ['高温电池报警', '2019/6/15 12:22:00', '0:02:44'],
                    ['高温电池报警', '2019/6/14 11:26:00', '0:02:42'],
                    ['高温电池报警', '2019/6/13 12:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/12 11:06:00', '0:11:42'],
                    ['高温电池报警', '2019/6/11 10:06:00', '0:02:33'],
                    ['高温电池报警', '2019/6/10 11:19:00', '0:02:42'],
                    ['高温电池报警', '2019/6/9 11:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/8 10:06:00', '0:34:55']
                ]
            } else if (val == 2) {
                this.tableData2.tbody = [
                    ['高温电池报警', '2019/6/7 11:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/6 10:06:00', '0:02:55'],
                    ['高温电池报警', '2019/6/5 11:06:00', '0:02:42'],
                ]
            }
        },
        handleSizeChange2 (val) {
            if (val == 10) {
                this.tableData2.tbody = [
                   ['高温电池报警', '2019/6/18 11:59:00', '0:02:34'],
                    ['高温电池报警', '2019/6/17 11:44:00', '0:12:42'],
                    ['高温电池报警', '2019/6/15 12:22:00', '0:02:44'],
                    ['高温电池报警', '2019/6/14 11:26:00', '0:02:42'],
                    ['高温电池报警', '2019/6/13 12:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/12 11:06:00', '0:11:42'],
                    ['高温电池报警', '2019/6/11 10:06:00', '0:02:33'],
                    ['高温电池报警', '2019/6/10 11:19:00', '0:02:42'],
                    ['高温电池报警', '2019/6/9 11:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/8 10:06:00', '0:34:55']
                ]
            } else {
                this.tableData2.tbody = [
                    ['高温电池报警', '2019/6/18 11:59:00', '0:02:34'],
                    ['高温电池报警', '2019/6/17 11:44:00', '0:12:42'],
                    ['高温电池报警', '2019/6/15 12:22:00', '0:02:44'],
                    ['高温电池报警', '2019/6/14 11:26:00', '0:02:42'],
                    ['高温电池报警', '2019/6/13 12:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/12 11:06:00', '0:11:42'],
                    ['高温电池报警', '2019/6/11 10:06:00', '0:02:33'],
                    ['高温电池报警', '2019/6/10 11:19:00', '0:02:42'],
                    ['高温电池报警', '2019/6/9 11:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/8 10:06:00', '0:34:55'],
                    ['高温电池报警', '2019/6/7 11:06:00', '0:02:42'],
                    ['高温电池报警', '2019/6/6 10:06:00', '0:02:55'],
                    ['高温电池报警', '2019/6/5 11:06:00', '0:02:42'],
                ]
            }
        },
        handleCurrentChange3 (val) {
            if (val == 1) {
                this.tableData3.tbody = [
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [3, '电压异常预警', '已审核'],
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [3, '电压异常预警', '已审核'],
                    [2, '电压异常预警', '已审核'],
                    [1, '车辆离群预警', '已审核'],
                    [4, '车辆离群预警', '已审核'],
                    [2, '车辆离群预警', '已审核']
                ]
            } else if (val == 2) {
                this.tableData3.tbody = [
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [2, '车辆离群预警', '已审核']
                ]
            }
        },
        handleSizeChange3 (val) {
            if (val == 10) {
                this.tableData3.tbody = [
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [3, '电压异常预警', '已审核'],
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [3, '电压异常预警', '已审核'],
                    [2, '电压异常预警', '已审核'],
                    [1, '车辆离群预警', '已审核'],
                    [4, '车辆离群预警', '已审核'],
                    [2, '车辆离群预警', '已审核']
                ]
            } else {
                this.tableData3.tbody = [
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [2, '车辆离群预警', '已审核'],
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [3, '电压异常预警', '已审核'],
                    [4, '电压异常预警', '已审核'],
                    [1, '电压异常预警', '已审核'],
                    [3, '电压异常预警', '已审核'],
                    [2, '电压异常预警', '已审核'],
                    [1, '车辆离群预警', '已审核'],
                    [4, '车辆离群预警', '已审核'],
                    [2, '车辆离群预警', '已审核']
                ]
            }
        },
        handleCurrentChange4 (val) {
            if (val == 1) {
                this.tableData4.tbody = [
                    ['电池高温异常维修', '2019/6/18 16:16:00', '人工维修'],
                    ['绝缘维修', '2019/6/5 11:06:00', '机器维修'],
                    ['电池高温异常维修', '2019/5/18 11:26:00', '人工维修'],
                    ['电池高温异常维修', '2019/4/15 9:36:00', '人工维修'],
                    ['绝缘维修', '2019/3/10 19:46:00', '机器维修'],
                    ['电池高温异常维修', '2019/2/2 18:56:00', '人工维修'],
                ]
            } else if (val == 2) {
                this.tableData4.tbody = [
                    
                    
                ]
            }
        },
        handleSizeChange4 (val) {
            if (val == 10) {
                this.tableData4.tbody = [
                   ['电池高温异常维修', '2019/6/18 16:16:00', '人工维修'],
                    ['绝缘维修', '2019/6/5 11:06:00', '机器维修'],
                    ['电池高温异常维修', '2019/5/18 11:26:00', '人工维修'],
                    ['电池高温异常维修', '2019/4/15 9:36:00', '人工维修'],
                    ['绝缘维修', '2019/3/10 19:46:00', '机器维修'],
                    ['电池高温异常维修', '2019/2/2 18:56:00', '人工维修'],
                ]
            } else {
                this.tableData4.tbody = [
                    ['电池高温异常维修', '2019/6/18 16:16:00', '人工维修'],
                    ['绝缘维修', '2019/6/5 11:06:00', '机器维修'],
                    ['电池高温异常维修', '2019/5/18 11:26:00', '人工维修'],
                    ['电池高温异常维修', '2019/4/15 9:36:00', '人工维修'],
                    ['绝缘维修', '2019/3/10 19:46:00', '机器维修'],
                    ['电池高温异常维修', '2019/2/2 18:56:00', '人工维修'],
                ]
            }
        },
        handleCurrentChange5 (val) {
            if (val == 1) {
                this.tableData5.tbody = [
                      ['43', '2019/6/20 14:06:00', '2:06:34', '39'],
                    ['45', '2019/6/19 12:56:00', '3:06:00', '38'],
                    ['47', '2019/6/18 12:46:00', '4:06:25', '37'],
                    ['49', '2019/6/17 12:36:00', '2:06:00', '36'],
                    ['51', '2019/6/15 12:26:00', '3:06:00', '35'],
                    ['53', '2019/6/14 12:16:00', '4:04:44', '34'],
                    ['55', '2019/6/13 12:06:00', '2:06:00', '33'],
                    ['57', '2019/6/12 11:56:00', '3:06:00', '32'],
                    ['59', '2019/6/10 11:46:00', '4:02:35', '31'],
                    ['61', '2019/6/8 15:36:00', '4:06:00', '30']
                ]
            } else if (val == 2) {
                this.tableData5.tbody = [
                    ['43', '2019/6/7 15:00:00', '2:08:11', '29'],
                    ['45', '2019/6/6 12:06:00', '3:06:00', '28'],
                    ['47', '2019/6/5 15:00:00', '2:46:00', '27'],
                    
                ]
            }
        },
        handleSizeChange5 (val) {
            if (val == 10) {
                this.tableData5.tbody = [
                   ['43', '2019/6/20 14:06:00', '2:06:34', '39'],
                    ['45', '2019/6/19 12:56:00', '3:06:00', '38'],
                    ['47', '2019/6/18 12:46:00', '4:06:25', '37'],
                    ['49', '2019/6/17 12:36:00', '2:06:00', '36'],
                    ['51', '2019/6/15 12:26:00', '3:06:00', '35'],
                    ['53', '2019/6/14 12:16:00', '4:04:44', '34'],
                    ['55', '2019/6/13 12:06:00', '2:06:00', '33'],
                    ['57', '2019/6/12 11:56:00', '3:06:00', '32'],
                    ['59', '2019/6/10 11:46:00', '4:02:35', '31'],
                    ['61', '2019/6/8 15:36:00', '4:06:00', '30']
                ]
            } else {
                this.tableData5.tbody = [
                    ['43', '2019/6/20 14:06:00', '2:06:34', '39'],
                    ['45', '2019/6/19 12:56:00', '3:06:00', '38'],
                    ['47', '2019/6/18 12:46:00', '4:06:25', '37'],
                    ['49', '2019/6/17 12:36:00', '2:06:00', '36'],
                    ['51', '2019/6/15 12:26:00', '3:06:00', '35'],
                    ['53', '2019/6/14 12:16:00', '4:04:44', '34'],
                    ['55', '2019/6/13 12:06:00', '2:06:00', '33'],
                    ['57', '2019/6/12 11:56:00', '3:06:00', '32'],
                    ['59', '2019/6/10 11:46:00', '4:02:35', '31'],
                    ['61', '2019/6/8 15:36:00', '4:06:00', '30'],
                     ['43', '2019/6/7 15:00:00', '2:08:11', '29'],
                    ['45', '2019/6/6 12:06:00', '3:06:00', '28'],
                    ['47', '2019/6/5 15:00:00', '2:46:00', '27'],
                ]
            }
        },
    },
    components: {
        toph,
        HistoricalTable
    }
}
</script>
<style scoped>
    .table {
        width: 100%;
    }
    .table thead tr {
        background: #FAFAFA;
        color: #7791A7;
        font-size: 14px;
        height: 50px;
    }
    .table thead tr th {
        font-weight: 600;
        border-bottom: 2px solid #E7EBF2;
    }
    .table tbody tr td {
        text-align: center;
        border-bottom: 1px solid #F1F6F9;
        height: 44px;
        color: #3F536E;
    }
    /deep/.form-box .el-form-item__label {
        color: #3E526F;
    }
    /deep/.search-box .el-form-item{
        margin-bottom: 0;
    }
    .tabs-box {
        margin-top: 10px;
        background: #fff;
    }
    /deep/.tabs-box .el-tabs__nav-wrap::after{
        display: none;
    }
    /deep/.tabs-box .el-tabs__active-bar{
        display: none;
    }
    /deep/.tabs-box .el-tabs__item{
        color: #7791A7;
    }
    /deep/.tabs-box .is-active{
        background: #fff;
        color: #239FFF;
    }
    /deep/.tabs-box .el-tabs__header{
        background: #F7F7F7;
        margin-bottom: 0;
    }
    /deep/.tabs-box .el-tabs__content{
        padding: 10px 15px;
    }
    /deep/.tabs-box .el-tabs__item.is-top:nth-child(2) {
        padding-left: 20px;
    }
    /deep/.tabs-box .el-tabs__item.is-top:last-child {
        padding-right: 20px;
    }
    .pagingtion-box{
         position: relative;
    }
    /deep/.pagingtion-box .el-pagination__total {
        position: absolute;
        left: 0;
    }
    /deep/.pagingtion-box .el-pagination__sizes {
        position: absolute;
        left: 67px;
    }
    /deep/.pagingtion-box .el-pagination__total {
        font-size: 14px;
        color: #606266;
    }
    /deep/.pagingtion-box .el-input__inner {
        font-size: 14px;
        color: #606266;
    }
    /deep/.pagingtion-box .el-pager .number {
        font-size: 14px;
        color: #303133;
    }
    /deep/.pagingtion-box .el-pager .active {
        color: #409EFF;
    }
    /deep/.header.nav .content .el-menu--horizontal > .el-menu-item.is-active {
        color: #fff !important;
        background: transparent !important;
    }
    .search-box {
        padding: 12px 15px;
        background: #fff;
        border-radius: 4px;
    }
    .wrap {
        min-width: 100%;
        min-height: 100%;
        background: #f4f7fc;
    }
    .title {
        font-size: 14px;
        padding: 10px 15px;
        color: #2B405B;
    }
    .main {
        padding: 0 10px 10px;
    }
</style>